#+title: Linux高级

* shell脚本
- bash语法检查: bash -n
  - 调试: bash -x
- 脚本错误常见的有3种
  - 语法错误,会导致后续的命令不继续执行,可以用bash -n检查错误
  - 命令错误,后续的命令还会继续执行,用bash -n无法检查出来,可以使用bash -x进行观察
  - 逻辑错误,只能使用bash -x进行观察
- $- 变量(bash有效)
  - h: 打开选项后.shell会将命令所在的路径hash下来.通过set +h将h选项关闭
  - i: 当前shell是一个交互式的shell.在脚本中,i选项是关闭的
  - m: monitor,打开监控模式,就可以通过Job control来控制进程的停止,继续,后台或者前台执行等
  - B: braceexpand,大括号扩展
  - H: 可以通过!感叹号来调用历史命令
- set
  - set -o 查看选项
  - set -o errexit on 防止命令错误继续执行
    - help set
    - 同set -e
      遇到$?不为0就退出
    - true,echo $?永远为真
    - false,echo $?永远为假
  - set -u 防止使用未定义的变量
    - 同set -o nounset
  - set -ue
  - set -x 当执行命令时,打印命令及其参数,类似bash -x
  - shift
    #+begin_src shell
#!/bin/bash
PASS=evil520
while [ "$1" ];do
      useradd $1 && echo $1 is created || echo $1 is exist
      echo $PASS | passwd --stdin $1 &> /dev/null
      shift
done
    #+end_src
- while read
  #+begin_src shell
WARNING=100
ss -nt |sed -En '/^ESTAB/s#.*[: ]([^:]+[0-9]):[0-9]+#\1#p' |sort |uniq -c |while read count ip;do
    if [ $count -gt $WARNING ];then
       iptables -A INPUT -s $ip -j REJECT
    fi
done
  #+end_src
- select循环与菜单
  - select与if语法一样
    - help select
    - select variable in list; do  done
  - 用户输入的变量放入REPLY中
  - example
    #+begin_src shell
PS3="请输入菜的编号"
select MENU in 鲍鱼 满汉全席 龙虾 燕窝 帝王蟹 退出;do
               case $REPLY in
                   1|3) echo "$MENU price is \$10"
                       ;;
                   2) echo "$MENU price is \$1000"
                       ;;
                   4|5) echo "$MENU price is \$20"
                        ;;
                   6) break
                      ;;
                   ,*) echo "点错了,没有这道菜"
                esac
done
    #+end_src

    #+RESULTS:
- 信号捕捉
  - 查看: man 7 signal
  - 定义信号触发器: trap 'echo "Press ctrl+c"' int quit
    - 当触发2,3信号打印
    - trap '' int
      当触发2信号什么也不做
    - trap '-' int
      还原2信号的功能
    - trap 函数名 exit
      退出时要执行的函数
